%% Modelling Gauss
pc_number = 10;                 % íîìåð ìàøèíû
sigma_param = pc_number/10;      % ïàðàìåòð ñèãìà
mu_param = pc_number/5;      % çíà÷åíèå ïàðàìåòðà a èëè m

%% Ñôîðìèðîâàòü íîðìàëüíî ðàñïðîåäåëåííóþ ÑÂ íà îñíîâå ðàâíîìåðíî ðàñïðåäåëåííûõ ÑÂ
% Èñïîëüçîâàòü ôóíêöèè rand èëè random äëÿ ôîðìèðîâàíèÿ íóæíîãî ðàñïðåäåëåíèÿ
n=8000;                                 % ÷èñëî îòñ÷åòîâ ÑÂ - áåðåòñÿ íà âàøå óñìîòðåíèå
x_1 = random('Uniform',0,1,[1,n]);      % çäåñü èñïîëüçîâàíà ôóíêöèÿ random
x_2 = random('ÂÏÈÑÀÒÜ','ÇÀÄÀÒÜ ÏÀÐÀÌÅÒÐ','ÇÀÄÀÒÜ ÏÀÐÀÌÅÒÐ',[1,n]);              
% Ôîðìèðîâàíèå ðàñïåðåäåëåíèÿ ñòðåáóåìûì çàêîíîì (çäåñü íîðìàëüíûé)
y_1=(-2*log(x_1)).^(1/2);   % Ðýëååâñêàÿ ÑÂ
y_2=sin(2*pi*x_2);          % Àðêñèíóñíàÿ ÑÂ
y_custom = sigma_param * y_1.*y_2 + mu_param;       % ïîëó÷àåì âåëè÷èíó, ðàñïðåäåëåííóþ ïî íîðìàëüíîìó çàêîíó
y_matlab = random('ÂÏÈÑÀÒÜ','ÏÀÐÀÌÅÒÐ 1','ÏÀÐÀÌÅÒÐ 2',[1,n]);       % ðåøàåì ýòó æå çàäà÷ó ñ èñïîëüçîâàíèåì âñòðîåííîé ôóíêöèè (ìîæíî ñ randn âìåñòî random)

% Ïîäãîòîâêà ãèñòîãðàììû
edges=-3*sigma_param+mu_param:sigma_param/6:3*sigma_param+mu_param;             % óñòàíàâëèâàåì èíòåðâàë è ãðàíè÷íûå àáñöèññû ñòîëáöîâ ãèñòîãðàììû
% âûïîëíÿåì ðàñ÷åò îðäèíàò ñ íîðìèðîâêîé ê îáùåìñó ÷èñëó çíà÷åíèé - ïîëó÷àåì ïëîòíîñòü ðàñïðåäëåíèÿ,
% àïïðîêñèìèðîâàííóþ ãèñòîãðàììîé
w_y_custom = histcounts(y_custom, edges, 'Normalization', 'ÇÀÄÀÒÜ ÏÀÐÀÌÅÒÐ');   % çíà÷åíèÿ ãèñòîãðàìì äëÿ ÑÂ íàøåé ôóíêöèè
w_y_matlab = histcounts(y_matlab, edges, 'Normalization', 'ÇÀÄÀÒÜ ÏÀÐÀÌÅÒÐ');   % çíà÷åíèÿ ãèñòîãðàìì äëÿ ÑÂ âñòðîåííîé ôóíêöèè
w_y_analytic='ÂÏÈÑÀÒÜ ÔÎÐÌÓËÓ w(y)';        % ðàññ÷èòàåì ôóíêöèþ
% íóæíî ïåðåñ÷èòàòü ãðàíèöû èíòåðâàëîâ ãèñòîãðàììû â èõ ñåðåäèíû
int=edges(1:end-1)-(edges(1)-edges(2))/2; 

% Ãðàôèêà ðàñïðåäåëåíèÿ äëÿ Y
figure();
grid on;    % âêëþ÷èòü ñåòêó íà ãðàôèêàõ
hold on;    % íå ñòèðàòü íàðèñîâàííîå - ïîçâîëÿåò äîðèñîâàòü àíàëèòè÷åñêóþ ôóíêöèþ ïëîòíîñòè âåðîÿòíîñòè
bar(int,[w_y_custom; w_y_matlab].');        % âûâåñòè íîðèðîâàííûå ãèñòîãðàììû
plot(int,w_y_analytic,'g','LineWidth',3);   % äîðèñîâûâàåì ôóíêöèþ ïëîòíîñòè âåðîÿòíîñòè
legend('Ïðåîáðàçîâàíèå','Âñòðîåííàÿ ôóíêöèÿ','Àíàëèòè÷åñêè çàä.') % ëåãåíäà - çäåñü íè÷åãî ìåíÿòü íå íàäî

% Ãðàôèêà ðàñïðåäåëåíèÿ äëÿ X

%% Ìîäåëèðîâàíèå âàøåãî ðàñïðåäåëåíèÿ
